{
  "id": "XNC-20260110-0005",
  "title": "Nhắm mắt... TU luôn!",
  "provider": "openai",
  "apiSource": "local",
  "dnaStyle": "funny",
  "idea": "Hai thằng ăn trộm mon men theo đường làng, lẻn vào một vườn trái cây.\nThằng trộm GÀ đang hí hửng leo cây hái trái thì thằng trộm VỊT thì thào:\n\"Đại ca ơi, bên kia có đống đồ ngon hơn trái cây nhiều! Lấy không?\"\nBỗng từ dưới cây vang lên giọng nói trầm trầm:\n\"Kệ! Nhắm mắt chơi luôn!\"\nThằng trộm VỊT mừng rơn, chạy cái vèo qua bên kia gom đồ.\nLát sau, trên cây thằng trộm GÀ  lại gọi:\n\"Mày ơi, tao thấy đằng kia có cây xoài ngon quá! Lấy không?\"\nGiọng nói lại vang lên:\n\"Kệ! Nhắm mắt quất luôn!\"\nThằng trộm GÀ liền bảo:\n\"Mày gom rải trái cây theo tao, tao trèo qua đó!\"\nThằng trộm VỊT ôm bao đồ quay lại, thấy thằng kia đang treo lủng lẳng trên cây xoài, tay vẫn thoăn thoắt hái.\nNó ngạc nhiên hỏi:\n\"Sao mày qua đây rồi?\"\nĐột nhiên giọng nói lại cất lên:\n\"Kệ! Nhắm mắt xơi luôn!\"\nHai thằng trộm ngơ ngác nhìn nhau... rồi mới phát hiện ra:\nBốn đứa nhóc đang ngồi dưới gốc cây, tay cầm bao chôm chôm, vừa ăn vừa cười hớn hở, chôm chôm đầy mặt!\nThằng trộm gà hét lên:\n\"Lũ nhóc...\"\nBỗng một giọng chú tư gầm lên vang dội: \"KỆ... NHẮM MẮT GOM LUÔN!\"\nChú tư mat ham ham cầm cây gậy dài đuổi theo hai thằng trộm chạy bán sống bán chết.\nCòn bốn đứa nhóc vẫn ngồi ung dung... ăn chôm chôm ngon lành. tum la moi trong bao cua ten trom duoc may lon nuoc ngot. 4 dua hi hung : “Ke ..nham mat tu luon”\n",
  "characters": [
    "Bô-Lô",
    "Ba-La",
    "Tùm-Lum",
    "Tùm-La",
    "Chú Tư",
    "Tên Trộm Gà",
    "Tên Trộm Vịt"
  ],
  "story": "**Title: Xóm Ngàn Chuyện**\n**Setting: Một vườn trái cây trong xóm, cây cối um tùm, tiếng chim hót líu lo. Hai thằng trộm đang lén lút.**\n**[SFX: Tiếng lá xào xạc, tiếng chim hót.]**\n**Thằng trộm GÀ đang hí hửng leo cây hái chôm chôm**\n**Tên Trộm Vịt: (thì thào) Đại ca ơi, bên kia có đống đồ ngon hơn trái cây nhiều! Lấy không?**\n**[SFX: Tiếng bước chân nhẹ nhàng.]**\n**Tên Trộm Gà:** (vui vẻ) Kệ! Nhắm mắt chơi luôn!**\n**[SFX: Tiếng nhảy xuống đất.]**\n**Tên Trộm Vịt:** (hưng phấn) Được rồi! Tao qua đó gom đồ nha!**\n**[SFX: Tiếng chạy rào rào.]**\n**[SFX: Tiếng Gà kêu.]**\n**Tên Trộm Gà:** (gọi lớn) Mày ơi, tao thấy đằng kia có cây xoài ngon quá! Lấy không?\n**[SFX: Tiếng cành cây rung rinh.]**\n**Giọng nói trầm trầm:** (vang vọng) Kệ! Nhắm mắt quất luôn!**\n**Tên Trộm Gà:** (gật gù) Được, mày gom rải trái cây theo tao, tao trèo qua đó!**\n**[SFX: Tiếng bước chân trở lại.]**\n**[SFX: Tiếng bao đồ sột soạt.]**\n**Tên Trộm Vịt:** (vui vẻ) Ê, tao ôm bao đồ quay lại nè! Mày sao rồi?**\n**[SFX: Tiếng Gà trèo lên cây xoài.]**\n**Tên Trộm Gà:** (trong khi hái) Tao đang trèo lên cây xoài nè, tay vẫn thoăn thoắt hái!**\n**Tên Trộm Vịt:** (ngạc nhiên) Sao mày qua đây rồi?**\n**[SFX: Tiếng cành cây rung động mạnh.]**\n**Giọng nói trầm trầm:** (vang vọng) Kệ! Nhắm mắt xơi luôn!**\n**[SFX: Tiếng ngạc nhiên.]**\n**Tên Trộm Gà:** (hoang mang) Hả? Là sao?**\n**Tên Trộm Vịt:** (bối rối) Đợi chút đã, bên dưới có chuyện gì vậy?**\n**[SFX: Tiếng trẻ con cười giòn tan.]**\n**Tùm-La:** (hăng hái) Chôm chôm ngon quá đi!**Tên Trộm Gà:** (hét lên) Lũ nhóc...!**\n\n**[SFX: Tiếng cây gậy đập mạnh xuống đất.]**\n**Chú Tư:** (gầm lên) KỆ... NHẮM MẮT GOM LUÔN!**\n**[SFX: Tiếng chân chạy ầm ầm.]**\n**Tên Trộm Vịt:** (hoảng hốt) Chạy đi, chạy đi!**\n**Tên Trộm Gà:** (vội vàng) Trời đất ơi, rượt rồi kìa!**\n**[SFX: Tiếng chạy, tiếng thở dốc.]**\n**Tùm-Lum:** (vẫn ăn chôm chôm) Kệ! Nhắm mắt tiếp tục ăn đi!**\n**[SFX: Tiếng cười giòn giã của trẻ con.]**\n**Tùm-La:** (nháy mắt) Mấy chú ăn trộm chạy đi kìa, vui ghê!Tay nhanh thoăn thoắt lấy 4 lon nước ngọt trong bao đồ của tên trộm!**\n**tieng mở lon nước ngọt** \n**Tùm Lum: \"KỆ! NHẮM MẮT .. TU LUÔN!\"\n**[SFX: Tiếng gậy đập đất, tiếng cười của bọn trẻ.]**\n**[END SCENE]**",
  "updatedAt": "2026-01-11T14:27:20.669Z"
}

