{
  "id": "XNC-20260110-0005",
  "title": "Nhắm mắt... gom luôn!",
  "provider": "openai",
  "apiSource": "local",
  "dnaStyle": "funny",
  "idea": "Hai thằng ăn trộm mon men theo đường làng, lẻn vào một vườn trái cây.\nThằng trộm 1 đang hí hửng leo cây hái trái thì thằng trộm 2 thì thào:\n\"Đại ca ơi, bên kia có đống đồ ngon hơn trái cây nhiều! Lấy không?\"\nBỗng từ dưới cây vang lên giọng nói trầm trầm:\n\"Kệ! Nhắm mắt chơi luôn!\"\nThằng trộm 2 mừng rơn, chạy cái vèo qua bên kia gom đồ.\nLát sau, trên cây thằng trộm 1 lại gọi:\n\"Mày ơi, tao thấy đằng kia có cây xoài ngon quá! Lấy không?\"\nGiọng nói lại vang lên:\n\"Kệ! Nhắm mắt quất luôn!\"\nThằng trộm 1 liền bảo:\n\"Mày gom rải trái cây theo tao, tao trèo qua đó!\"\nThằng trộm 2 ôm bao đồ quay lại, thấy thằng kia đang treo lủng lẳng trên cây xoài, tay vẫn thoăn thoắt hái.\nNó ngạc nhiên hỏi:\n\"Sao mày lấy được nhiều thế? Sao tao lại không lấy được gì hết vậy?\"\nĐột nhiên giọng nói lại cất lên:\n\"Kệ! Nhắm mắt xơi luôn!\"\nHai thằng trộm ngơ ngác nhìn nhau... rồi mới phát hiện ra:\nBốn đứa nhóc đang ngồi dưới gốc cây, tay cầm bao chôm chôm, vừa ăn vừa cười hớn hở, chôm chôm đầy mặt!\nThằng trộm 1 hét lên:\n\"Lũ nhóc...\"\nBỗng một giọng gầm vang dội:\n\"KỆ... NHẮM MẮT GOM LUÔN!\"\nBác chủ vườn cầm cây gậy dài đuổi theo hai thằng trộm chạy bán sống bán chết.\nCòn bốn đứa nhóc vẫn ngồi ung dung... ăn chôm chôm ngon lành.",
  "characters": [
    "Bô-Lô",
    "Ba-La",
    "Tùm-Lum",
    "Tùm-La",
    "Chú Tư",
    "Tên Trộm Gà"
  ],
  "story": "**Title: Xóm Ngàn Chuyện**\n\n**[SFX: Tiếng chim hót và tiếng lá xào xạc]**\n\n**[Scene: Một vườn trái cây xanh tươi. Hai thằng trộm đang lén lút di chuyển trong làng.]**\n\n**Tên Trộm Vịt:** (lén lút) Ê, mày thấy không? Ở đây trái cây đầy, chắc mình làm một phát cho đã! \n\n**Tên Trộm gà:** (hí hửng) Ừ, tao leo lên cây hái cho mày coi nè! \n\n**[SFX: Tiếng lá xào xạc khi Tên Trộm gà leo cây]**\n\n**Tên Trộm vịt:** (thì thào) Đại ca ơi, bên kia có đống đồ ngon hơn trái cây nhiều! Lấy không?\n\n**[SFX: Tiếng lá rơi khi Tên Trộm gà hái trái cây]**\n\n**Giọng nói từ dưới cây:** (trầm trầm) Kệ! Nhắm mắt chơi luôn!\n\n**Tên Trộm vịt:** (mừng rơn) Trời đất ơi! Mày nói đúng, đi luôn!\n\n**[SFX: Tiếng chân chạy vội vã]**\n\n**[Scene chuyển sang Tên Trộm vịt gom đồ bên đống đồ ăn ngon.]**\n\n**Tên Trộm gà:** (gọi từ trên cây) Mày ơi, tao thấy đằng kia có cây xoài ngon quá! Lấy không?\n\n**Giọng nói:** (vang lên) Kệ! Nhắm mắt quất luôn!\n\n**[SFX: Tiếng trái cây rơi lả tả]**\n\n**Tên Trộm gà:** (hào hứng) Mày gom rải trái cây theo tao, tao trèo qua đó!\n\n**[SFX: Tiếng Tên Trộm vịt ôm bao đồ quay lại]**\n\n**[Scene: Tên Trộm vịt quay lại và thấy Tên Trộm gà treo lủng lẳng trên cây xoài.]**\n\n**Tên Trộm vịt:** (ngạc nhiên) Sao mày lấy được nhiều thế? Sao tao lại không lấy được gì hết vậy?\n\n**[SFX: Tiếng cười của bốn đứa nhóc dưới gốc cây]**\n\n**Giọng nói:** (lại vang lên) Kệ! Nhắm mắt xơi luôn!\n\n**[Scene: Tên Trộm gà và Tên Trộm vịt ngơ ngác nhìn nhau.]**\n\n**Tên Trộm gà:** (hốt hoảng) Lũ nhóc...\n\n**[SFX: Tiếng cười hớn hở của bốn đứa nhóc]**\n\n**[Scene: Bốn đứa nhóc ngồi dưới gốc cây, tay cầm bao chôm chôm, vừa ăn vừa cười.]**\n\n**Bô-Lô:** (hớn hở) Ngon quá đi! Trời ơi, ăn chôm chôm mà vui ghê!\n\n**Ba-La:** (mồm nhồm nhoàm) Hèn chi tụi nó không lấy được gì, tụi mình vui quá mà!\n\n**Tùm-Lum:** (tự tin) Mình có chiến thuật riêng mà, hihi!\n\n**Tùm-La:** (mischievous) Cứ nhắm mắt mà ăn thôi, không cần sợ!\n\n**[SFX: Tiếng gậy đập mạnh xuống đất]**\n\n**Bác chủ vườn:** (gầm vang) KỆ... NHẮM MẮT GOM LUÔN!\n\n**[SFX: Tiếng chân chạy vội vã của Tên Trộm gà và Tên Trộm vịt]**\n\n**Tên Trộm vịt:** (hốt hoảng) Chạy đi! Bác chủ vườn đuổi kìa!\n\n**Tên Trộm gà:** (bán sống bán chết) Trời đất ơi, sao mà lại bị lũ nhóc cướp mất vậy?!\n\n**[Scene: Bốn đứa nhóc vẫn ung dung ngồi ăn chôm chôm, tiếng cười giòn tan.]**\n\n**Bô-Lô:** (hóm hỉnh) Chạy đi, tụi mày! Để tụi mình ăn hết chôm chôm nha!\n\n**[SFX: Tiếng cười vang vọng khắp vườn trái cây.]**\n\n**[Fade Out]**",
  "updatedAt": "2026-01-10T12:50:12.016Z"

}
