{
  "id": "XNC-20251226-0004",
  "title": "bai kiem tra cuoi ky",
  "provider": "openai",
  "apiSource": "local",
  "dnaStyle": "funny",
  "idea": "bala: tao voi may do dap an coi dung khong?\ntumla: ok luon\nbala: 1a , 2b, 3c, 4d...\ntumla: ê!tao voi may giong nhau het chac dung roi!\ntumlum chu y lang nghe.\nbolo: hai tui bây khac day sao trung de duoc?\n2 dua nhin nhau mat tai mec. tumlum giat minh\ntumla: tao lam de 1. may de may?\nbala: chet roi! tao de 2.\ntumlum mim cuoi..vay tao giong may ne tao cung lam de 1.\nbolo: tao doc van thay may lam sai sai cai gi do! \ntumla: sao may biet tao sai?\nbolo: vi tao chep trom bai cua tumlum.\ntumla: vay tao sai cai gi?\nbolo: thi mon toan sao lai hoi dien tich viet nam nhi?\n3 dua ha hoc mom: \"cai gi?nay thi mon toan ha?\"",
  "characters": [
    "Bô-Lô",
    "Ba-La",
    "Tùm-Lum",
    "Tùm-La"
  ],
  "story": "**Title: Xóm Ngàn Chuyện**\n\n**[SFX: Tiếng chuông báo giờ học, tiếng ghế kéo ra.]**\n\n**[Scene: Một lớp học tiểu học, các học sinh đang ngồi bàn. Bô-Lô, Ba-La, Tùm-Lum và Tùm-La đang làm bài tập.]**\n\n**Bô-Lô:** (đeo kính, nhìn vào bài) Nè, hai đứa, tụi mày có chắc là đáp án đúng không vậy? \n\n**Ba-La:** (vung tay) Hèn chi, tao với mày giống nhau hết rồi! Tao làm từ 1 đến 4 là 1a, 2b, 3c, 4d...\n\n**Tùm-Lum:** (cười khúc khích) Ê! Tụi mày có chắc không vậy? \n\n**[SFX: Tiếng ghế ngồi lại.]**\n\n**Bô-Lô:** (nhìn hai đứa) Hai tụi bây khắc nhau sao mà giống hoài vậy? \n\n**Ba-La:** (hơi lo lắng) Trời đất, chắc chắn là đúng rồi! \n\n**Tùm-La:** (nháy mắt) Thì tao làm đề 1. Còn mày thì đề 2 hả? \n\n**Ba-La:** (cười lớn) Chết rồi! Tao làm đề 2! \n\n**Tùm-Lum:** (mỉm cười) Vậy tao giống mày nè, tao cũng làm đề 1. \n\n**Bô-Lô:** (đọc bài) Tao đọc văn thấy mày làm sai sai cái gì đó! \n\n**Tùm-La:** (nghi ngờ) Sao mày biết tao sai? \n\n**Bô-Lô:** (khoe khoang) Vì tao chép trộm bài của Tùm-Lum! \n\n**Tùm-Lum:** (hét lên) Vậy là tao sai cái gì? \n\n**Bô-Lô:** (chỉ vào bài) Thì môn toán sao lại hỏi diện tích Việt Nam nhi? \n\n**Tùm-La:** (mặt nghiêm túc) Cái gì vậy trời? Môn này là môn toán hay địa lý vậy? \n\n**Ba-La:** (nhướng mày) Chắc chắn là môn toán, nhưng mà có cái gì lạ lạ vậy trời? \n\n**[SFX: Tiếng cười lớn từ các bạn học.]**\n\n**Tùm-Lum:** (nhún vai) Thôi kệ, miễn có điểm là được! \n\n**Bô-Lô:** (cười) Thì hèn chi tụi mày giống nhau, làm bài mà không thèm xem lại!\n\n**Ba-La:** (nháy mắt) Vậy tụi mình làm lại đi! \n\n**Tùm-La:** (đứng lên) Đúng rồi! Làm lại cho chắc! \n\n**[SFX: Tiếng ghế kéo lại, bọn trẻ hối hả làm bài.]**\n\n**Bô-Lô:** (cười khúc khích) Lần sau nhớ xem lại nha, không thôi lại thiệt thòi! \n\n**Tùm-Lum:** (vẫy tay) Đi học mà, có gì đâu, chỉ cần vui là đủ rồi! \n\n**[SFX: Tiếng cười và tiếng bàn ghế xôn xao, fade out.]**\n\n**[End Scene]**",
  "updatedAt": "2025-12-26T00:43:32.490Z"
}