{
  "version": "1.0",
  "series_id": "XNC",
  "schema": {
    "outfit": {
      "id": "string",
      "name": "string",
      "category": "uniform|personal|event",
      "priority": "number",
      "allow_signature_color": "boolean",
      "variants": "{male?, female?}",
      "fit_overrides": "optional",
      "notes": "optional"
    }
  },
  "outfits": [
    {
      "id": "xnc_uniform_primary_male",
      "name": "Đồng phục tiểu học (Nam)",
      "category": "uniform",
      "priority": 100,
      "allow_signature_color": false,
      "notes": "Áo trắng, quần xanh đậm; phù hợp bối cảnh trường tiểu học Việt Nam.",
      "variants": {
        "male": {
          "base_desc_vi": "Áo sơ mi trắng ngắn tay, quần tây xanh đậm, giày bata hoặc dép sandal học sinh, bảng tên nhỏ (không chữ).",
          "base_desc_en": "Vietnamese primary school boy uniform: short-sleeve white shirt, dark navy trousers, simple student shoes or sandals, small blank name tag (no text)."
        }
      }
    },
    {
      "id": "xnc_uniform_primary_female",
      "name": "Đồng phục tiểu học (Nữ)",
      "category": "uniform",
      "priority": 100,
      "allow_signature_color": false,
      "notes": "Áo trắng, váy xanh đậm; kiểu đồng phục phổ biến ở Việt Nam.",
      "variants": {
        "female": {
          "base_desc_vi": "Áo sơ mi trắng ngắn tay, váy xanh đậm (hoặc quần xanh đậm tùy trường), giày bata hoặc dép sandal học sinh, bảng tên nhỏ (không chữ).",
          "base_desc_en": "Vietnamese primary school girl uniform: short-sleeve white shirt, dark navy skirt (or trousers depending on school), simple shoes or sandals, small blank name tag (no text)."
        }
      }
    },
    {
      "id": "xnc_outfit_bolo_everyday",
      "name": "Bô-Lô – đồ thường ngày",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "male": {
          "base_desc_vi": "Áo thun xanh dương đơn giản, quần nâu, kính tròn nhỏ luôn đeo; phong cách học sinh nhà quê Việt Nam.",
          "base_desc_en": "Vietnamese primary school boy everyday outfit: simple blue T-shirt, brown pants; always wears small round glasses; rural Vietnamese kid vibe."
        }
      }
    },
    {
      "id": "xnc_outfit_bala_everyday",
      "name": "Ba-La – đồ thường ngày",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "fit_overrides": {
        "body_type": "chubby"
      },
      "variants": {
        "male": {
          "base_desc_vi": "Áo thun đỏ, quần short đen; dáng hơi mũm mĩm, nhìn hiền và nhanh miệng.",
          "base_desc_en": "Vietnamese primary school boy everyday outfit: red T-shirt, black shorts; slightly chubby body; friendly talkative look."
        }
      }
    },
    {
      "id": "xnc_outfit_tumlum_everyday",
      "name": "Tùm-Lum – đồ thường ngày",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "female": {
          "base_desc_vi": "Tóc dài hơi rối, cuốn lô to trên đầu; váy/vạt áo màu vàng nổi, phối phụ kiện lạ đời nhưng tự tin.",
          "base_desc_en": "Vietnamese primary school girl everyday outfit: long slightly messy hair with big rollers; bright yellow quirky outfit; confident pose, comedic high-fashion vibe."
        }
      }
    },
    {
      "id": "xnc_outfit_tumla_everyday",
      "name": "Tùm-La – đồ thường ngày",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "female": {
          "base_desc_vi": "Tóc ngắn cột nơ to; áo đỏ chấm bi, dáng đứng tinh quái, mắt láo liên.",
          "base_desc_en": "Vietnamese primary school girl everyday outfit: short hair with a big bow; red polka-dot top; mischievous stance and eyes."
        }
      }
    },
    {
      "id": "xnc_outfit_mom_bolo_everyday",
      "name": "Mẹ Bô-Lô – ở nhà",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "female": {
          "base_desc_vi": "Áo bông/áo hoa kiểu Việt Nam, tóc búi thấp, tạp dề bếp; không khí gia đình Việt.",
          "base_desc_en": "Vietnamese middle-aged mother: low bun hair, simple floral blouse, kitchen apron; warm Vietnamese family vibe."
        }
      }
    },
    {
      "id": "xnc_outfit_dad_bolo_everyday",
      "name": "Ba Bô-Lô – ở nhà",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "male": {
          "base_desc_vi": "Áo thun cũ hoặc sơ mi đơn giản, quần short, dép nhựa (dép tổ ong/dép lê); dáng hiền, hơi mệt.",
          "base_desc_en": "Vietnamese middle-aged father: old T-shirt or simple button shirt, shorts, plastic sandals; gentle tired look."
        }
      }
    },
    {
      "id": "xnc_outfit_chu_tu_everyday",
      "name": "Chú Tư – đồ thường",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "male": {
          "base_desc_vi": "Áo sơ mi ngắn tay cũ, quần vải sờn, dép nhựa/dép lê; dáng gầy hơi khom, lúng túng.",
          "base_desc_en": "Vietnamese middle-aged man: worn short-sleeve shirt, old trousers, plastic sandals; thin slightly hunched posture, awkward comedic vibe."
        }
      }
    },
    {
      "id": "xnc_outfit_thief_chicken_sneaky",
      "name": "Tên trộm gà – lén lút",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "male": {
          "base_desc_vi": "Áo bà ba tối màu, quần tối màu, đeo dãi lụa màu đen khoét 2 lỗ ở mắt, đội nón cũ; vác bao tải có gà lòi đầu; tuyệt đối không đồ sọc tù kiểu Tây.",
          "base_desc_en": "The typical attire of a Vietnamese rural thief: a black and white striped T-shirt, dark trousers, a black silk belt with two eyelets, an old hat, plastic sandals, and carrying a sack with a chicken head sticking out."
        }
      }
    },
    {
      "id": "xnc_outfit_thief_duck_sneaky",
      "name": "Tên trộm vịt – lén lút",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "male": {
          "base_desc_vi": "đeo miếng che mắt màu đen có khoét lỗ, mặc áo khoác có mũ màu xanh đậm, quần rách, mang theo đèn pin và một túi đựng con vịt, lén lút đi lại.",
          "base_desc_en": "Vietnamese countryside thief outfit: a black blindfold with a hole in it, a dark blue hooded jacket, ripped pants, carried a flashlight and a bag containing a duck, and moved around stealthily."
        }
      }
    },
    {
      "id": "xnc_outfit_ba_tam_pho_everyday",
      "name": "Bà Tám bán phở – đồ bộ",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "female": {
          "base_desc_vi": "Đồ bộ hoa sặc sỡ kiểu Việt Nam, dép lê; dáng phúc hậu, miệng cười nói chuyện.",
          "base_desc_en": "Vietnamese middle-aged woman: colorful floral do bo home wear, simple sandals; friendly chubby gossiping pose."
        }
      }
    },
    {
      "id": "xnc_outfit_hai_ngan_milk",
      "name": "Cô Hai Ngàn – bán sữa",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": true,
      "variants": {
        "female": {
          "base_desc_vi": "Áo bà ba nâu đất, quần đen, đội nón lá; ôm bình sữa nhôm; nét hiền, e thẹn.",
          "base_desc_en": "Vietnamese young woman: brown ao ba ba, black trousers, conical hat, holding an aluminum milk can; gentle shy expression."
        }
      }
    },
    {
      "id": "xnc_outfit_shipper_uniform",
      "name": "Anh shipper – đồng phục giao hàng",
      "category": "personal",
      "priority": 10,
      "allow_signature_color": false,
      "notes": "Giữ vibe giao hàng Việt Nam; không logo thương hiệu, không chữ.",
      "variants": {
        "male": {
          "base_desc_vi": "Áo khoác giao hàng màu vàng, mũ bảo hiểm vàng, thùng hàng phía sau xe (không chữ, không logo).",
          "base_desc_en": "Vietnamese delivery uniform: bright yellow jacket and helmet, delivery box on scooter (no text, no logo)."
        }
      }
    },
    {
    "id": "xnc_outfit_aodai",
    "name": "Áo dài cách tân",
    "category": "personal",
    "priority": 20,
    "allow_signature_color": true,
    "notes": "Trang phục thanh lịch, hiện đại cho Mira; phối hợp với nét cáo thông minh.",
    "variants": {
      "female": {
        "base_desc_vi": "Áo dài cách tân tà ngắn, họa tiết hoa nhí, quần ống rộng lửng; tóc xõa tự nhiên phối băng đô lụa.",
        "base_desc_en": "Vietnamese modern stylized Ao Dai: short tunic with small floral patterns, cropped wide-leg pants; loose hair with a silk headband; elegant fox-girl vibe."
      }
    }
  },
    {
    "id": "xnc_outfit_baba",
    "name": "Áo ba ba",
    "category": "personal",
    "priority": 20,
    "allow_signature_color": true,
    "notes": "Trang phục thanh lịch, hiện đại cho Mira; phối hợp với nét cáo thông minh.",
    "variants": {
      "female": {
        "base_desc_vi": "Áo bà ba Việt Nam: áo ngắn, xẽ 2 tà họa tiết hoa nhỏ, quần ống rộng lửng; tóc xõa với băng đô lụa; toát lên vẻ thanh lịch, quyến rũ.",
        "base_desc_en": "Vietnamese áo bà ba: a short blouse with two slits and small floral patterns, paired with wide-legged cropped trousers; hair is loose with a silk headband; exuding elegance and charm."
      }
    }
  },
  {
    "id": "xnc_outfit_mit_overalls",
    "name": "Đồ yếm dạo phố",
    "category": "personal",
    "priority": 15,
    "allow_signature_color": true,
    "fit_overrides": {
      "body_type": "chubby"
    },
    "variants": {
      "female": {
        "base_desc_vi": "Áo thun trắng bên trong, quần yếm jean (denim overalls), mang túi đeo chéo nhỏ; dáng vẻ tinh nghịch, bụng hơi tròn.",
        "base_desc_en": "Cute streetwear: white T-shirt under denim overalls, small crossbody bag; chubby energetic kid look."
      }
    }
  },
  {
    "id": "xnc_outfit_farmer_working",
    "name": "Đồ đi làm đồng (kèm nón lá)",
    "category": "uniform",
    "priority": 50,
    "allow_signature_color": false,
    "variants": {
      "male": {
        "base_desc_vi": "Áo sơ mi dài tay màu tối sờn cũ, quần xắn gấu, đội nón lá, chân đi ủng nhựa; phong cách nông dân Việt Nam.",
        "base_desc_en": "Vietnamese farmer working outfit: dark worn long-sleeve shirt, rolled-up trousers, conical hat (non la), rubber boots; authentic rural vibe."
      }
    }
  },
  {
    "id": "xnc_outfit_children_rainy_day",
    "name": "Áo mưa cánh dơi trẻ em",
    "category": "event",
    "priority": 30,
    "allow_signature_color": true,
    "variants": {
      "male": {
        "base_desc_vi": "Áo mưa cánh dơi màu sắc rực rỡ (vàng/xanh), chất liệu nhựa trong, mũ trùm kín đầu; dáng chạy nhảy trong mưa.",
        "base_desc_en": "Kids' bat-wing raincoat: bright translucent plastic (yellow/blue), hood up; fun rainy day silhouette."
      },
      "female": {
        "base_desc_vi": "Áo mưa cánh dơi màu hồng/đỏ, có họa tiết chấm bi nhẹ, trùm kín người; tay cầm cán dù nhỏ.",
        "base_desc_en": "Girls' bat-wing raincoat: pink/red with subtle polka dots, fully covered; holding a small umbrella handle."
      }
    }
  },
  {
    "id": "xnc_outfit_hunk_sleepwear",
    "name": "ba bô-lô – Đồ ngủ/Ở nhà",
    "category": "personal",
    "priority": 10,
    "allow_signature_color": true,
    "variants": {
      "male": {
        "base_desc_vi": "Áo may ô (áo ba lỗ) trắng, quần đùi sọc, quấn khăn rằn ngang cổ; phong cách ông bố miền Tây thư giãn.",
        "base_desc_en": "Vietnamese father home wear: white tank top (may o), striped boxers, khan ran scarf around the neck; relaxed rural dad vibe."
      }
    }
  },
    {
    "id": "xnc_outfit_office_vn",
    "name": "Đồ công sở Việt Nam",
    "category": "uniform",
    "priority": 80,
    "allow_signature_color": true,
    "variants": {
      "male": {
        "base_desc_vi": "Áo sơ mi trắng hoặc xanh nhạt đóng thùng, quần tây đen, thắt lưng da, giày tây; phong cách nhân viên văn phòng gọn gàng.",
        "base_desc_en": "Vietnamese male office wear: tucked-in white or light blue button-down shirt, black trousers, leather belt, formal shoes; neat professional look."
      },
      "female": {
        "base_desc_vi": "Áo sơ mi thắt nơ hoặc áo kiểu công sở, chân váy bút chì hoặc quần tây lửng, giày cao gót quai mảnh; thanh lịch và hiện đại.",
        "base_desc_en": "Vietnamese female office wear: blouse with a bow or stylish top, pencil skirt or cropped trousers, slim high heels; elegant and modern."
      }
    }
  },
  {
    "id": "xnc_outfit_mechanic_worker",
    "name": "Đồ thợ máy / Kỹ thuật",
    "category": "uniform",
    "priority": 70,
    "allow_signature_color": false,
    "notes": "Trang phục bảo hộ lao động phổ biến tại Việt Nam.",
    "variants": {
      "male": {
        "base_desc_vi": "Bộ đồ bảo hộ (jumpsuit) hoặc áo khoác kaki màu xanh bích/xám, nhiều túi hộp, dính vài vết dầu mỡ, dắt tua vít ở túi ngực.",
        "base_desc_en": "Mechanic uniform: navy blue or grey khaki jumpsuit/work jacket, multiple cargo pockets, slight grease stains, a screwdriver peeking from the chest pocket."
      }
    }
  },
  {
    "id": "xnc_outfit_teacher_aodai",
    "name": "Áo dài truyền thống giáo viên",
    "category": "event",
    "priority": 90,
    "allow_signature_color": true,
    "notes": "Hình ảnh cô giáo Việt Nam điển hình.",
    "variants": {
      "female": {
        "base_desc_vi": "Áo dài truyền thống cổ cao, tà dài chấm gót, màu sắc nhã nhặn hoặc họa tiết hoa văn nhẹ nhàng, tay cầm cặp da hoặc giáo án.",
        "base_desc_en": "Traditional Vietnamese teacher Ao Dai: high collar, long flowing tunic reaching ankles, subtle colors or patterns; holding a leather briefcase or lesson plans."
      }
    }
  },
  {
    "id": "xnc_outfit_party_dress",
    "name": "Đầm dự tiệc",
    "category": "event",
    "priority": 60,
    "allow_signature_color": true,
    "variants": {
      "female": {
        "base_desc_vi": "Đầm xòe hoặc đầm ôm dự tiệc sang trọng, chất liệu lấp lánh hoặc ren, phối phụ kiện khuyên tai và túi cầm tay nhỏ.",
        "base_desc_en": "Elegant party dress: flared or bodycon silhouette, sequined or lace fabric, accessorized with earrings and a small clutch bag."
      }
    }
  },
  {
    "id": "xnc_outfit_picnic_camping",
    "name": "Đồ đi dã ngoại / Picnic",
    "category": "personal",
    "priority": 40,
    "allow_signature_color": true,
    "variants": {
      "male": {
        "base_desc_vi": "Áo thun năng động, quần short túi hộp, đội mũ lưỡi trai, mang giày leo núi hoặc sandal quai hậu.",
        "base_desc_en": "Outdoor picnic outfit: active T-shirt, cargo shorts, baseball cap, hiking shoes or sport sandals."
      },
      "female": {
        "base_desc_vi": "Áo thun ôm phối quần jean ngắn hoặc váy yếm, đội mũ cói, mang balo nhỏ; phong cách trẻ trung thoải mái.",
        "base_desc_en": "Cute camping outfit: fitted T-shirt with denim shorts or overall dress, straw hat, small backpack; youthful and comfortable."
      }
    }
  },
  {
    "id": "xnc_outfit_gym_sport",
    "name": "Đồ tập thể dục",
    "category": "personal",
    "priority": 30,
    "allow_signature_color": true,
    "variants": {
      "male": {
        "base_desc_vi": "Áo ba lỗ thể thao, quần short vải thun co giãn, mang giày chạy bộ, quấn băng cổ tay.",
        "base_desc_en": "Sportswear: athletic tank top, stretchy shorts, running shoes, wristbands."
      },
      "female": {
        "base_desc_vi": "Áo bra thể thao hoặc áo thun sát nách, quần legging ôm sát, tóc cột đuôi ngựa cao; năng động và khỏe khoắn.",
        "base_desc_en": "Gym outfit: sports bra or sleeveless tee, tight leggings, high ponytail; energetic and healthy look."
      }
    }
  }
  ]
}
